import java.sql.SQLOutput;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        //1. После запуска программа должна спрашивать у пользователя, на скольких человек необходимо разделить счёт.
        System.out.println("Привет! На сколько человек мне разделить счет?");
        //2. Программа должна выводить сообщение об ошибке, когда:
        //- Количество человек, введённых пользователем, равно 1. В этом случае нет смысла ничего считать и делить.
        Scanner scanner = new Scanner(System.in);
        int sumGuests;

        while (true) {
            sumGuests = scanner.nextInt();
            //- Количество человек меньше 1. Это некорректное значение для подсчёта.
            if (sumGuests > 1) {
                System.out.println("Вас " + sumGuests + " человека? Класс, тогда давайте поделим счет!");
                break;
            }
            if (sumGuests == 1) {
                System.out.println("Вы один? Жаль, но к сожалению тут делить нечего, кроме слез одиночества;)   ");
            }
            //Если значение некорректное, то показать ошибку и заново попросить пользователя ввести корректное количество гостей.
            if (sumGuests <= 0) {
                System.out.println("Ой, кажется вы ошиблись;)! Введите от 2х человек и мы попробуем снова!");
            }
            System.out.println("Давайте попробуем снова: ");

        }
        scanner.nextLine();
        //System.out.println("Давайте попробуем снова: ");
        var c = new Calculator(sumGuests);
        while (true) {
//Запросите у пользователя название товара и его стоимость. Стоимость должна быть в формате рубли.копейки, например 10.45 или 11.40.
            String productName;
            System.out.println("Какой у вас товар?");
            productName = scanner.nextLine();
            System.out.println("Напишите стоимость продукта: ");
            double price;
            price = scanner.nextDouble();
            //Сделать цикс while
            scanner.nextLine();
//Полученный товар должен быть добавлен в калькулятор.
            var p = new Product(productName, price);
            c.add(p);
//При добавлении товара в калькулятор нужно считать текущую общую сумму всех товаров.
//Калькулятор должен запоминать названия всех добавленных товаров, чтобы выводить все товары, которые были в него добавлены.
//После добавления товара в калькулятор нужно показать пользователю сообщение об успешном добавлении товара.
            System.out.println("Товар успешно добавлен!");
            //После добавления товара нужно спрашивать у пользователя, хочет ли он добавить ещё один товар.
            System.out.println("Может еще по одной;)");
//Пользователь должен ввести команду "Завершить" для того, чтоб завершить процесс добавления товаров.
//Введение любого другого символа или слова должно запрашивать у пользователя следующий товар до тех пор, пока пользователь не введёт команду "Завершить" после добавления товара.
//Пользователь может ввести команду "Завершить" в любом регистре (завершить, ЗАВЕРШИТЬ, заВЕрШиТь и пр.), и это должно завершать процесс добавления товара.

            var input = scanner.nextLine();

            if (input.equalsIgnoreCase("завершить")) {
                break;


            }
        }
        //После того как пользователь введёт команду "Завершить" после добавления товаров, нужно показать пользователю все добавленные товары и посчитать, сколько должен заплатить каждый человек.
        //Каждый новый добавленный товар должен быть выведен с новой строки после текста: "Добавленные товары:". Вы можете использовать символ \n в строке, чтобы указать компилятору,
        // что нужно сделать в этом месте переноса строки.
        System.out.println("Добавленные товары: ");
        System.out.println(c.list);
        //Вывод суммы, которую должен заплатить каждый человек, должен быть в формате "10.45". Дробная часть не должна содержать больше двух чисел после запятой.
        //Сумма считается в рублях. Ваша задача — обработать правильный вывод. Если сумма 1.45, то вы должны вывести "1.45 рубль", а если сумма будет 3.20 или 4.00, вы
        // должны вывести 3.20 рубля или 4.00 рубля. Окончания в слове "рубль" должны зависеть от целочисленной части.
        System.out.println(c.getResult());
    }
}




